#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=328dc19a-7332-467a-ab99-3dcb040fe441]
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bc1747b2-0d08-4dc7-9b9e-bd3fe294e5ea]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a849cfea-06c5-4c7a-96d4-b129ed4ef14f]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=83e71261-0e19-4a3d-8197-9af135129ca5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0761203a-2944-4aa8-ab11-1d0ae1d7f471]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5a899829-73cb-4d83-aa47-9ff5cfc09811]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f9b5dd63-6b70-4ce1-9503-2848391bd5c1]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a3db851f-e00f-4187-b2cb-43e52a785f34]
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=71a51674-2976-4b11-865a-3bec3dcbd60c]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e99b7489-51d4-4537-bb5d-5955559c1fa9]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=358cf837-d744-4111-9911-ee0b21c2a8e5]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4f010028-c094-426d-b75e-b1a3bbf34e56]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b8d474eb-690d-4ff6-943b-d1f11c0df54f]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ef7c68d5-5d2f-470f-835a-03b49edf6c7a]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d88c19f8-86da-4ae5-bb41-9257b272479a]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7f2b8414-48a5-4045-b477-40852eaf501e]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5d4b88c0-8ce2-41ad-92f5-903bc4bcf045]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=83ab957d-9026-4268-8783-be60c70a7757]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5ff9a99e-210c-4667-9612-a087313f6869]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=00ca6796-98fc-4d4a-b9fb-fcf28ed78ec3]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b9aab272-78e1-4cce-bae9-671b7e9dd760]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2cb561ea-840a-4fe8-bb27-4f75eab10b08]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=705ef65b-1002-4ffb-8567-daec3f1337fe]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ccd59005-c1fb-4121-955f-e9e46707277f]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6437efc7-6192-475a-97ed-c3f7666a52ad]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=de31cad2-c65a-4c3f-b579-da9c8f6fc7e5]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=eb2779a8-08c8-4182-a33d-0b08d2f8e9ff]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c2ab73ce-2e68-4ee8-8e7f-1eaf0062dcca]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1e33299f-6543-4a86-8be2-2df9259e26a6]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=28c2b610-f326-4432-a070-d6a53a73e545]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c1a3b516-1e66-4387-bfcb-be6146cd4df0]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3581290c-b8db-43cf-8200-7a2e7a181f13]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=614c4c6e-6791-4223-bf67-7e3c5c2c5fad]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8767f238-14c1-40a7-b5c7-637225122ce7]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=06a1f71b-7f6c-41e1-bda8-730e1e66bd2a]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3928016b-9993-4ae4-8f5a-f2c988710f6b]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5f2e7cb5-4203-45e8-97bf-26e62a071753]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=157c5fc1-4957-4134-855a-e94e8d60f2d8]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2b0a92d5-c80d-405d-806d-395d38edf809]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9324b99a-fbf3-473d-b34d-e56d786848aa]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ea90df44-6f29-4da4-b3f0-b7cf51b2f87d]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=81ae7720-b6b4-4b44-9a91-1467bc214c5b]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=edb9b7eb-a870-42b6-8fcb-ce214e846d92]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2ef72e58-6423-4d3d-b500-5616b969fe5d]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=285ebf48-8e15-4386-aed7-0147382d37f1]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1144b98a-53a6-45b2-88be-37d1f4f8d883]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=cad7d7a8-a658-4e49-bb6c-5781a807e59e]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2555485a-a51e-4c1b-abf3-a773e3691cfe]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b46263c0-37c7-4d6d-bb80-11501602777d]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cfe34f04-d971-435c-a908-342e2fdf567c]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=14c65911-9b02-4bf5-8723-7555e8425c38]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=51ac4855-a9b3-4d95-a825-7ddaf2b870a3]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7888c0f9-7cfc-4017-9248-cee1c419c7a7]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f13c5a82-e594-4403-a728-c6bddd2681ba]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6058e278-c6cb-47dd-881c-4d7c9b2dd1df]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7ad5bf86-606e-44c0-b602-e3d26dd378e0]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=512c1cce-8b3c-4adc-88ba-d18d55398163]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=895aee78-2a68-44ec-85c3-b05bda2df617]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=916cc6a4-7729-45e4-a74b-618aaa83d18a]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b0da9850-619f-4388-b419-c35dc71d8646]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=abee11b5-692a-4b5f-9873-571fcec4f923]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=228000d0-3e9f-4d89-bfe6-32768754a956]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9840615d-67c9-4e53-8d2b-59e5c684075c]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ff51c39-4330-4c11-90ff-7829fd948015]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2e62bc1f-6ddb-4b80-87e6-2681927bca93]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4b46641d-88f3-45b9-8470-fe9c5a09d2fa]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=90968149-1285-4050-959a-c52f6f9d014d]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cf9573a2-c57f-45e0-a3fc-57d8550ef3d2]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=82106d8a-a91e-4d60-9704-53b3fb54e214]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5085baad-9389-4763-b3d0-b81582d7c661]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=899f01df-da01-4de6-8c91-f7e55450df79]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=014a20f4-7c12-447e-80d1-52b58aa01bac]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=313fa3d3-996f-4ae7-8b59-45eeaca7a5ee]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7c9737d5-668f-401b-a9d9-92bc6ce3aab3]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4b190ce6-4b44-43a6-9df6-b8492f63bc7c]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=9071cad4-008b-4ea0-bc56-6630ad7e4b15]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b769b4af-d555-4b44-aa17-99e776c10353]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d6262e46-cb71-4e9d-b8a1-890173b2109d]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=380b3c9f-2698-4bbb-9484-9ef2031fed55]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=67456bfc-9955-4e2e-adbe-29f23fe93297]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0158e912-ee0b-4c71-9e93-f311c88e0e18]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8ff6a0fe-9347-4bf4-813b-6f589390e6c0]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=82be4825-528a-4d35-89c1-6b612acad0e9]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6c7e0646-6f2a-4eb3-a7f4-31b0c340fe41]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0c81f44b-199f-4958-9041-7597f7acefd5]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=693e1fb8-b0f1-4500-85d8-79da11fb6b90]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d2d0dc53-54b9-4990-996e-b1fbc6b28223]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1171f0c5-d99a-433f-8e06-aa9755dcbbea]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5c0dc433-cdee-409a-a664-454333d15633]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5776640a-5533-45d8-854a-261a866a39f6]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=54ef8733-7d92-4861-856a-a09e62ba595e]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=916ee66d-a8b5-4245-a017-de284fc24705]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9c526bb9-bfb4-4911-9563-d307eeb8561b]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c4b0139d-00aa-4243-8f42-9498401e1501]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=893bcbd7-ec2b-45eb-8359-43eea32080ac]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5486d873-9227-4f7f-90c7-fb55af354dc0]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1c284bce-00b0-4fb2-a91d-6f074538b0a2]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9b502c1a-c266-4e70-8c61-bd149a822bb0]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=68ed2201-cb2c-48be-8bc9-c0937693dc0c]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ec9c89b1-a50c-4436-93ce-2a9269a8d727]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4ca2dc6b-a930-48c3-8c6f-e93edc3bbbb6]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8c801a7a-fbf6-4127-a5b3-1f89f5b26c05]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5a2e3188-50f1-40b6-b758-7f623344fd9b]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5f21918d-989f-43d5-b5b7-19b02854476a]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d4f514b1-c336-4b87-b52f-a6332cc9fe55]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e2ffe2c8-b585-44a4-a875-bbcb78d492bf]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2334c28a-3c4a-42f2-8731-e11176754253]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ae3b8bb9-5ce2-462a-827a-bf7f3bb2556b]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4c87fd52-363c-4af8-88bb-81c11752a21a]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=037b8cf6-6cc9-4f97-87ff-8e85e4d92193]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a892de72-c1a4-40a4-89bf-e88adea723f2]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=511f47e4-832b-4b91-a145-5f2ef547fc90]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a3080342-cba8-493a-8c3a-198a6a586c55]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0e86d674-6b15-43ad-9a59-4ed67e5716c1]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8f0198fb-0455-4811-820c-80e74acf4e7c]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=025f37e1-5d37-49c5-b919-150b46545b0b]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c0c370f9-04ad-4b39-9b29-af66bdbfff9d]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=eceb3f1d-925d-46b6-8fd1-2ba30696184f]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4a6406b5-4e77-491b-ab48-0839fb65c44a]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=923bb5f0-6d5b-4be4-864c-8abe19e58ece]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=156bc55b-210e-4f01-a713-0e6c11cf0361]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c588df82-b227-4530-981a-e0b9a2c596e1]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bd8c6ab7-d79f-4554-a338-24e81dc53946]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=81776136-87a7-49cc-8414-b47235b1ff03]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1ddb02b8-f198-4775-8c88-a72eace09720]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7caeb33f-4332-4959-84aa-4a8fc39d3cf7]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=968ff5f0-ec51-44c6-9fbc-bfa5b12d7710]
module.keycloak_dev.module.onestopauth.module.client_conf-2-2872.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5efdca46-4640-4a99-9eae-c78f927ec1e0]
module.keycloak_dev.module.onestopauth.module.client_conf-2-2872.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=628ec3c3-8803-4c44-beaa-cd819e8e31d9]
module.keycloak_dev.module.onestopauth.module.client_conf-2-2872.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a62ce17e-b248-4bd9-a401-4fe69db4cda3]
module.keycloak_dev.module.onestopauth.module.client_conf-2-2872.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1a4ba0ed-0c94-42a2-b690-7265206422d2]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9bf13edb-d5fd-4179-914a-70bfe1ddd84b]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a6bd66c9-e4c7-4d35-9acb-bef15f87422e]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0f2d9210-5c7c-4d1d-9831-1ddbdbd3bc56]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=03840481-4a87-4274-ad09-f53b7e14f92d]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5daa440c-9b6e-4a86-b1b2-aec7db902f8e]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0bcdff5c-7e36-466e-807d-489d49ba4f46]
module.keycloak_dev.module.onestopauth.module.client_conf-2-2872.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4af9b3e4-3cc2-4b6d-a7fd-992025914be7]
module.keycloak_dev.module.onestopauth.module.client_conf-2-2872.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8693389c-496d-4b08-b201-ab19c1f9f6bc]
module.keycloak_dev.module.onestopauth.module.client_conf-2-2872.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c3160240-bc5a-480f-8ad0-d864e462a8e9]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=09bf6d82-3a63-431c-8425-faf78176c2f3]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f6b8061d-6338-43a5-a5b8-3719b5f0bc8e]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5f709164-1575-43d0-811b-d6aa4909d4d2]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a7cffed4-f8d5-470b-9c6b-9c9c4e14ac55]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=68a2f533-ebae-4369-8773-e1a5d2a32306]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7288becc-cd99-4d6b-a994-e1b347bca160]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c2ac05dc-7383-4ddf-8d74-1d06576d5e94]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5c549940-4259-483d-9e8c-58798d94783d]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=15b25011-e2f9-4624-aa95-ec31762efd41]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=aaec779c-3997-4bd1-9110-053ac3562a1e]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=23bf5767-8186-4afc-83c8-c07b3ee1f5f9]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=735ef5cc-f171-4b01-9154-9a58908f2713]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dd1e36d8-5e78-4051-a411-74aecb4521a4]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d2abfa5d-7227-45c4-9007-6168a20c2236]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "a-2938"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "a-2938"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "a-2938"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "a-2938"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://dev",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "a-2938"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "a-2938"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "a-2938"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "a-2938"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2840 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*